Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4E8E.xml
          </instance>
        </module>
        <module name="LOCKBIT" version="1">
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" name="LOCKBIT" name-in-module="LOCKBIT" offset="0"/>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt index="-14" name="NonMaskableInt_IRQn" caption="Non Maskable Interrupt"/>
        <interrupt index="-12" name="MemoryManagement_IRQn" caption="Cortex-M4 Memory Management Interrupt"/>
        <interrupt index="-11" name="BusFault_IRQn" caption="Cortex-M4 Bus Fault Interrupt"/>
        <interrupt index="-10" name="UsageFault_IRQn" caption="Cortex-M4 Usage Fault Interrupt"/>
        <interrupt index="-5" name="SVCall_IRQn" caption="Cortex-M4 SV Call Interrupt"/>
        <interrupt index="-4" name="DebugMonitor_IRQn" caption="Cortex-M4 Debug Monitor Interrupt"/>
        <interrupt index="-2" name="PendSV_IRQn" caption="Cortex-M4 Pend SV Interrupt"/>
        <interrupt index="-1" name="SysTick_IRQn" caption="Cortex-M4 System Tick Interrupt"/>
        <interrupt index="0" module-instance="SYSC" name="SUPC" caption="Supply Controller"/>
        <interrupt index="1" module-instance="SYSC" name="RSTC" caption="Reset Controller"/>
        <interrupt index="2" module-instance="SYSC" name="RTC" caption="Real Time Clock"/>
        <interrupt index="3" module-instance="SYSC" name="RTT" caption="Real Time Timer"/>
        <interrupt index="4" module-instance="SYSC" name="WDT" caption="Watchdog/Dual Watchdog Timer"/>
        <interrupt index="5" module-instance="PMC" name="PMC" caption="Power Management Controller"/>
        <interrupt index="6" module-instance="EFC" name="EFC" caption="Enhanced Embedded Flash Controller"/>
        <interrupt index="7" module-instance="UART0" name="UART0" caption="UART 0"/>
        <interrupt index="9" module-instance="PIOA" name="PIOA" caption="Parallel I/O Controller A"/>
        <interrupt index="10" module-instance="PIOB" name="PIOB" caption="Parallel I/O Controller B"/>
        <interrupt index="11" module-instance="PIOC" name="PIOC" caption="Parallel I/O Controller C"/>
        <interrupt index="12" module-instance="PIOD" name="PIOD" caption="Parallel I/O Controller D"/>
        <interrupt index="13" module-instance="PIOE" name="PIOE" caption="Parallel I/O Controller E"/>
        <interrupt index="14" module-instance="USART0" name="USART0" caption="USART 0"/>
        <interrupt index="15" module-instance="USART1" name="USART1" caption="USART 1"/>
        <interrupt index="16" module-instance="HSMCI" name="HSMCI" caption="Multimedia Card Interface"/>
        <interrupt index="17" module-instance="TWI0" name="TWI0" caption="Two Wire Interface 0"/>
        <interrupt index="18" module-instance="TWI1" name="TWI1" caption="Two Wire Interface 1"/>
        <interrupt index="19" module-instance="SPI" name="SPI" caption="Serial Peripheral Interface"/>
        <interrupt index="20" module-instance="DMAC" name="DMAC" caption="DMAC"/>
        <interrupt index="21" module-instance="TC0" name="TC0" caption="Timer/Counter 0"/>
        <interrupt index="22" module-instance="TC0" name="TC1" caption="Timer/Counter 1"/>
        <interrupt index="23" module-instance="TC0" name="TC2" caption="Timer/Counter 2"/>
        <interrupt index="24" module-instance="TC1" name="TC3" caption="Timer/Counter 3"/>
        <interrupt index="25" module-instance="TC1" name="TC4" caption="Timer/Counter 4"/>
        <interrupt index="26" module-instance="TC1" name="TC5" caption="Timer/Counter 5"/>
        <interrupt index="27" module-instance="TC2" name="TC6" caption="Timer/Counter 6"/>
        <interrupt index="28" module-instance="TC2" name="TC7" caption="Timer/Counter 7"/>
        <interrupt index="29" module-instance="TC2" name="TC8" caption="Timer/Counter 8"/>
        <interrupt index="30" module-instance="AFEC0" name="AFEC0" caption="Analog Front End 0"/>
        <interrupt index="31" module-instance="AFEC1" name="AFEC1" caption="Analog Front End 1"/>
        <interrupt index="32" module-instance="DACC" name="DACC" caption="Digital To Analog Converter"/>
        <interrupt index="33" module-instance="ACC" name="ACC" caption="Analog Comparator"/>
        <interrupt index="35" module-instance="UDP" name="UDP" caption="USB DEVICE"/>
        <interrupt index="36" module-instance="PWM" name="PWM" caption="PWM"/>
        <interrupt index="37" module-instance="CAN0" name="CAN0" caption="CAN0"/>
        <interrupt index="38" module-instance="CAN1" name="CAN1" caption="CAN1"/>
        <interrupt index="39" module-instance="AES" name="AES" caption="AES"/>
        <interrupt index="44" module-instance="GMAC" name="GMAC" caption="EMAC"/>
        <interrupt index="45" module-instance="UART1" name="UART1" caption="UART"/>
      </interrupts>
      <interfaces>
        <interface type="samjtag" name="JTAG"/>
        <interface type="swd" name="SWD"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x05B3703F"/>
          <property name="CHIPID_CIDR" value="0xA3CC0CE0"/>
          <property name="CHIPID_EXID" value="0x00120208"/>
        </property-group>
      </property-groups>
      <parameters>
        <param name="__CM4_REV" value="0x0001"/>
        <param name="__MPU_PRESENT" value="1"/>
        <param name="__FPU_PRESENT" value="1"/>
        <param name="__NVIC_PRIO_BITS" value="4"/>
        <param name="__Vendor_SysTickConfig" value="0"/>
      </parameters>
    </device>
  </devices>
  <modules>
    <module caption="Analog Comparator Controller" name="ACC" version="6490E">
      <register-group name="ACC">
        <register caption="Control Register" name="ACC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="ACC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Selection for Minus Comparator Input" mask="0x00000007" name="SELMINUS" values="ACC_MR__SELMINUS"/>
          <bitfield caption="Selection For Plus Comparator Input" mask="0x00000070" name="SELPLUS" values="ACC_MR__SELPLUS"/>
          <bitfield caption="Analog Comparator Enable" mask="0x00000100" name="ACEN" values="ACC_MR__ACEN"/>
          <bitfield caption="Edge Type" mask="0x00000600" name="EDGETYP" values="ACC_MR__EDGETYP"/>
          <bitfield caption="Invert Comparator Output" mask="0x00001000" name="INV" values="ACC_MR__INV"/>
          <bitfield caption="Selection Of Fault Source" mask="0x00002000" name="SELFS" values="ACC_MR__SELFS"/>
          <bitfield caption="Fault Enable" mask="0x00004000" name="FE" values="ACC_MR__FE"/>
        </register>
        <register caption="Interrupt Enable Register" name="ACC_IER" offset="0x24" rw="W" size="4">
          <bitfield caption="Comparison Edge" mask="0x00000001" name="CE"/>
        </register>
        <register caption="Interrupt Disable Register" name="ACC_IDR" offset="0x28" rw="W" size="4">
          <bitfield caption="Comparison Edge" mask="0x00000001" name="CE"/>
        </register>
