Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4E8E.xml
        <register caption="AFEC Channel Differential Register" name="AFEC_DIFFR" offset="0x60" rw="RW" size="4">
          <bitfield caption="Differential inputs for channel 0" mask="0x00000001" name="DIFF0"/>
          <bitfield caption="Differential inputs for channel 1" mask="0x00000002" name="DIFF1"/>
          <bitfield caption="Differential inputs for channel 2" mask="0x00000004" name="DIFF2"/>
          <bitfield caption="Differential inputs for channel 3" mask="0x00000008" name="DIFF3"/>
          <bitfield caption="Differential inputs for channel 4" mask="0x00000010" name="DIFF4"/>
          <bitfield caption="Differential inputs for channel 5" mask="0x00000020" name="DIFF5"/>
          <bitfield caption="Differential inputs for channel 6" mask="0x00000040" name="DIFF6"/>
          <bitfield caption="Differential inputs for channel 7" mask="0x00000080" name="DIFF7"/>
          <bitfield caption="Differential inputs for channel 8" mask="0x00000100" name="DIFF8"/>
          <bitfield caption="Differential inputs for channel 9" mask="0x00000200" name="DIFF9"/>
          <bitfield caption="Differential inputs for channel 10" mask="0x00000400" name="DIFF10"/>
          <bitfield caption="Differential inputs for channel 11" mask="0x00000800" name="DIFF11"/>
          <bitfield caption="Differential inputs for channel 12" mask="0x00001000" name="DIFF12"/>
          <bitfield caption="Differential inputs for channel 13" mask="0x00002000" name="DIFF13"/>
          <bitfield caption="Differential inputs for channel 14" mask="0x00004000" name="DIFF14"/>
          <bitfield caption="Differential inputs for channel 15" mask="0x00008000" name="DIFF15"/>
        </register>
        <register caption="AFEC Channel Register Selection" name="AFEC_CSELR" offset="0x64" rw="RW" size="4">
          <bitfield caption="Channel Selection" mask="0x0000000F" name="CSEL"/>
        </register>
        <register caption="AFEC Channel Data Register" name="AFEC_CDR" offset="0x68" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="AFEC Channel Offset Compensation Register" name="AFEC_COCR" offset="0x6C" rw="RW" size="4">
          <bitfield caption="Analog Offset" mask="0x00000FFF" name="AOFF"/>
        </register>
        <register caption="AFEC Temperature Sensor Mode Register" name="AFEC_TEMPMR" offset="0x70" rw="RW" size="4">
          <bitfield caption="Temperature Sensor RTC Trigger mode" mask="0x00000001" name="RTCT"/>
          <bitfield caption="Temperature Comparison Mode" mask="0x00000030" name="TEMPCMPMOD" values="AFEC_TEMPMR__TEMPCMPMOD"/>
        </register>
        <register caption="AFEC Temperature Compare Window Register" name="AFEC_TEMPCWR" offset="0x74" rw="RW" size="4">
          <bitfield caption="Temperature Low Threshold" mask="0x0000FFFF" name="TLOWTHRES"/>
          <bitfield caption="Temperature High Threshold" mask="0xFFFF0000" name="THIGHTHRES"/>
        </register>
        <register caption="AFEC Analog Control Register" name="AFEC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="AFEC Bias Current Control" mask="0x00000300" name="IBCTL"/>
        </register>
        <register caption="AFEC Correction Select Register" name="AFEC_COSR" offset="0xD0" rw="RW" size="4"/>
        <register caption="AFEC Correction Values Register" name="AFEC_CVR" offset="0xD4" rw="RW" size="4"/>
        <register caption="AFEC Channel Error Correction Register" name="AFEC_CECR" offset="0xD8" rw="RW" size="4"/>
        <register caption="AFEC Write Protection Mode Register" name="AFEC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY" values="AFEC_WPMR__WPKEY"/>
        </register>
        <register caption="AFEC Write Protection Status Register" name="AFEC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Receive Pointer Register" name="AFEC_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="AFEC_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="AFEC_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="AFEC_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="AFEC_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="AFEC_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="AFEC_MR__TRGEN">
        <value caption="Hardware triggers are disabled. Starting a conversion is only possible by software." name="DIS" value="0"/>
        <value caption="Hardware trigger selected by TRGSEL field is enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="AFEC_MR__TRGSEL">
        <value caption="ADTRG pin" name="AFEC_TRIG0" value="0x0"/>
        <value caption="TIO Output of the Timer Counter Channel 0" name="AFEC_TRIG1" value="0x1"/>
        <value caption="TIO Output of the Timer Counter Channel 1" name="AFEC_TRIG2" value="0x2"/>
        <value caption="TIO Output of the Timer Counter Channel 2" name="AFEC_TRIG3" value="0x3"/>
        <value caption="PWM Event Line 0" name="AFEC_TRIG4" value="0x4"/>
        <value caption="PWM Event Line 1" name="AFEC_TRIG5" value="0x5"/>
      </value-group>
