Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4E8E.xml
        <register caption="Interrupt Disable Register" name="CAN_IDR" offset="0x0008" rw="W" size="4">
          <bitfield caption="Mailbox 0 Interrupt Disable" mask="0x00000001" name="MB0"/>
          <bitfield caption="Mailbox 1 Interrupt Disable" mask="0x00000002" name="MB1"/>
          <bitfield caption="Mailbox 2 Interrupt Disable" mask="0x00000004" name="MB2"/>
          <bitfield caption="Mailbox 3 Interrupt Disable" mask="0x00000008" name="MB3"/>
          <bitfield caption="Mailbox 4 Interrupt Disable" mask="0x00000010" name="MB4"/>
          <bitfield caption="Mailbox 5 Interrupt Disable" mask="0x00000020" name="MB5"/>
          <bitfield caption="Mailbox 6 Interrupt Disable" mask="0x00000040" name="MB6"/>
          <bitfield caption="Mailbox 7 Interrupt Disable" mask="0x00000080" name="MB7"/>
          <bitfield caption="Error Active Mode Interrupt Disable" mask="0x00010000" name="ERRA"/>
          <bitfield caption="Warning Limit Interrupt Disable" mask="0x00020000" name="WARN"/>
          <bitfield caption="Error Passive Mode Interrupt Disable" mask="0x00040000" name="ERRP"/>
          <bitfield caption="Bus Off Mode Interrupt Disable" mask="0x00080000" name="BOFF"/>
          <bitfield caption="Sleep Interrupt Disable" mask="0x00100000" name="SLEEP"/>
          <bitfield caption="Wakeup Interrupt Disable" mask="0x00200000" name="WAKEUP"/>
          <bitfield caption="Timer Overflow Interrupt" mask="0x00400000" name="TOVF"/>
          <bitfield caption="TimeStamp Interrupt Disable" mask="0x00800000" name="TSTP"/>
          <bitfield caption="CRC Error Interrupt Disable" mask="0x01000000" name="CERR"/>
          <bitfield caption="Stuffing Error Interrupt Disable" mask="0x02000000" name="SERR"/>
          <bitfield caption="Acknowledgment Error Interrupt Disable" mask="0x04000000" name="AERR"/>
          <bitfield caption="Form Error Interrupt Disable" mask="0x08000000" name="FERR"/>
          <bitfield caption="Bit Error Interrupt Disable" mask="0x10000000" name="BERR"/>
        </register>
        <register caption="Interrupt Mask Register" name="CAN_IMR" offset="0x000C" rw="R" size="4">
          <bitfield caption="Mailbox 0 Interrupt Mask" mask="0x00000001" name="MB0"/>
          <bitfield caption="Mailbox 1 Interrupt Mask" mask="0x00000002" name="MB1"/>
          <bitfield caption="Mailbox 2 Interrupt Mask" mask="0x00000004" name="MB2"/>
          <bitfield caption="Mailbox 3 Interrupt Mask" mask="0x00000008" name="MB3"/>
          <bitfield caption="Mailbox 4 Interrupt Mask" mask="0x00000010" name="MB4"/>
          <bitfield caption="Mailbox 5 Interrupt Mask" mask="0x00000020" name="MB5"/>
          <bitfield caption="Mailbox 6 Interrupt Mask" mask="0x00000040" name="MB6"/>
          <bitfield caption="Mailbox 7 Interrupt Mask" mask="0x00000080" name="MB7"/>
          <bitfield caption="Error Active Mode Interrupt Mask" mask="0x00010000" name="ERRA"/>
          <bitfield caption="Warning Limit Interrupt Mask" mask="0x00020000" name="WARN"/>
          <bitfield caption="Error Passive Mode Interrupt Mask" mask="0x00040000" name="ERRP"/>
          <bitfield caption="Bus Off Mode Interrupt Mask" mask="0x00080000" name="BOFF"/>
          <bitfield caption="Sleep Interrupt Mask" mask="0x00100000" name="SLEEP"/>
          <bitfield caption="Wakeup Interrupt Mask" mask="0x00200000" name="WAKEUP"/>
          <bitfield caption="Timer Overflow Interrupt Mask" mask="0x00400000" name="TOVF"/>
          <bitfield caption="Timestamp Interrupt Mask" mask="0x00800000" name="TSTP"/>
          <bitfield caption="CRC Error Interrupt Mask" mask="0x01000000" name="CERR"/>
          <bitfield caption="Stuffing Error Interrupt Mask" mask="0x02000000" name="SERR"/>
          <bitfield caption="Acknowledgment Error Interrupt Mask" mask="0x04000000" name="AERR"/>
          <bitfield caption="Form Error Interrupt Mask" mask="0x08000000" name="FERR"/>
          <bitfield caption="Bit Error Interrupt Mask" mask="0x10000000" name="BERR"/>
        </register>
        <register caption="Status Register" name="CAN_SR" offset="0x0010" rw="R" size="4">
          <bitfield caption="Mailbox 0 Event" mask="0x00000001" name="MB0"/>
          <bitfield caption="Mailbox 1 Event" mask="0x00000002" name="MB1"/>
          <bitfield caption="Mailbox 2 Event" mask="0x00000004" name="MB2"/>
          <bitfield caption="Mailbox 3 Event" mask="0x00000008" name="MB3"/>
          <bitfield caption="Mailbox 4 Event" mask="0x00000010" name="MB4"/>
          <bitfield caption="Mailbox 5 Event" mask="0x00000020" name="MB5"/>
          <bitfield caption="Mailbox 6 Event" mask="0x00000040" name="MB6"/>
          <bitfield caption="Mailbox 7 Event" mask="0x00000080" name="MB7"/>
          <bitfield caption="Error Active Mode" mask="0x00010000" name="ERRA"/>
          <bitfield caption="Warning Limit" mask="0x00020000" name="WARN"/>
          <bitfield caption="Error Passive Mode" mask="0x00040000" name="ERRP"/>
          <bitfield caption="Bus Off Mode" mask="0x00080000" name="BOFF"/>
          <bitfield caption="CAN controller in Low power Mode" mask="0x00100000" name="SLEEP"/>
          <bitfield caption="CAN controller is not in Low power Mode" mask="0x00200000" name="WAKEUP"/>
          <bitfield caption="Timer Overflow" mask="0x00400000" name="TOVF"/>
          <bitfield caption="Timestamp" mask="0x00800000" name="TSTP"/>
          <bitfield caption="Mailbox CRC Error" mask="0x01000000" name="CERR"/>
          <bitfield caption="Mailbox Stuffing Error" mask="0x02000000" name="SERR"/>
          <bitfield caption="Acknowledgment Error" mask="0x04000000" name="AERR"/>
          <bitfield caption="Form Error" mask="0x08000000" name="FERR"/>
          <bitfield caption="Bit Error" mask="0x10000000" name="BERR"/>
          <bitfield caption="Receiver busy" mask="0x20000000" name="RBSY"/>
          <bitfield caption="Transmitter busy" mask="0x40000000" name="TBSY"/>
          <bitfield caption="Overload busy" mask="0x80000000" name="OVLSY"/>
        </register>
        <register caption="Baudrate Register" name="CAN_BR" offset="0x0014" rw="RW" size="4">
          <bitfield caption="Phase 2 segment" mask="0x00000007" name="PHASE2"/>
          <bitfield caption="Phase 1 segment" mask="0x00000070" name="PHASE1"/>
          <bitfield caption="Programming time segment" mask="0x00000700" name="PROPAG"/>
          <bitfield caption="Re-synchronization jump width" mask="0x00003000" name="SJW"/>
          <bitfield caption="Baudrate Prescaler." mask="0x007F0000" name="BRP"/>
          <bitfield caption="Sampling Mode" mask="0x01000000" name="SMP" values="CAN_BR__SMP"/>
        </register>
