Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4E8E.xml
        <register caption="PWM Spread Spectrum Update Register" name="PWM_SSPUP" offset="0xA4" rw="W" size="4">
          <bitfield caption="Spread Spectrum Limit Value Update" mask="0x00FFFFFF" name="SPRDUP"/>
        </register>
        <register caption="PWM Stepper Motor Mode Register" name="PWM_SMMR" offset="0xB0" rw="RW" size="4">
          <bitfield caption="Gray Count ENable" mask="0x00000001" name="GCEN0"/>
          <bitfield caption="Gray Count ENable" mask="0x00000002" name="GCEN1"/>
          <bitfield caption="DOWN Count" mask="0x00010000" name="DOWN0"/>
          <bitfield caption="DOWN Count" mask="0x00020000" name="DOWN1"/>
        </register>
        <register caption="PWM Write Protection Control Register" name="PWM_WPCR" offset="0xE4" rw="W" size="4">
          <bitfield caption="Write Protection Command" mask="0x00000003" name="WPCMD" values="PWM_WPCR__WPCMD"/>
          <bitfield caption="Write Protection Register Group 0" mask="0x00000004" name="WPRG0"/>
          <bitfield caption="Write Protection Register Group 1" mask="0x00000008" name="WPRG1"/>
          <bitfield caption="Write Protection Register Group 2" mask="0x00000010" name="WPRG2"/>
          <bitfield caption="Write Protection Register Group 3" mask="0x00000020" name="WPRG3"/>
          <bitfield caption="Write Protection Register Group 4" mask="0x00000040" name="WPRG4"/>
          <bitfield caption="Write Protection Register Group 5" mask="0x00000080" name="WPRG5"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="PWM_WPCR__WPKEY"/>
        </register>
        <register caption="PWM Write Protection Status Register" name="PWM_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protect SW Status" mask="0x00000001" name="WPSWS0"/>
          <bitfield caption="Write Protect SW Status" mask="0x00000002" name="WPSWS1"/>
          <bitfield caption="Write Protect SW Status" mask="0x00000004" name="WPSWS2"/>
          <bitfield caption="Write Protect SW Status" mask="0x00000008" name="WPSWS3"/>
          <bitfield caption="Write Protect SW Status" mask="0x00000010" name="WPSWS4"/>
          <bitfield caption="Write Protect SW Status" mask="0x00000020" name="WPSWS5"/>
          <bitfield caption="Write Protect Violation Status" mask="0x00000080" name="WPVS"/>
          <bitfield caption="Write Protect HW Status" mask="0x00000100" name="WPHWS0"/>
          <bitfield caption="Write Protect HW Status" mask="0x00000200" name="WPHWS1"/>
          <bitfield caption="Write Protect HW Status" mask="0x00000400" name="WPHWS2"/>
          <bitfield caption="Write Protect HW Status" mask="0x00000800" name="WPHWS3"/>
          <bitfield caption="Write Protect HW Status" mask="0x00001000" name="WPHWS4"/>
          <bitfield caption="Write Protect HW Status" mask="0x00002000" name="WPHWS5"/>
          <bitfield caption="Write Protect Violation Source" mask="0xFFFF0000" name="WPVSRC"/>
        </register>
        <register caption="PWM Comparison 0 Value Register" name="PWM_CMPV0" offset="0x130" rw="RW" size="4">
          <bitfield caption="Comparison x Value" mask="0x00FFFFFF" name="CV"/>
          <bitfield caption="Comparison x Value Mode" mask="0x01000000" name="CVM"/>
        </register>
        <register caption="PWM Comparison 0 Value Update Register" name="PWM_CMPVUPD0" offset="0x134" rw="W" size="4">
          <bitfield caption="Comparison x Value Update" mask="0x00FFFFFF" name="CVUPD"/>
          <bitfield caption="Comparison x Value Mode Update" mask="0x01000000" name="CVMUPD"/>
        </register>
        <register caption="PWM Comparison 0 Mode Register" name="PWM_CMPM0" offset="0x138" rw="RW" size="4">
          <bitfield caption="Comparison x Enable" mask="0x00000001" name="CEN"/>
          <bitfield caption="Comparison x Trigger" mask="0x000000F0" name="CTR"/>
          <bitfield caption="Comparison x Period" mask="0x00000F00" name="CPR"/>
          <bitfield caption="Comparison x Period Counter" mask="0x0000F000" name="CPRCNT"/>
          <bitfield caption="Comparison x Update Period" mask="0x000F0000" name="CUPR"/>
          <bitfield caption="Comparison x Update Period Counter" mask="0x00F00000" name="CUPRCNT"/>
        </register>
        <register caption="PWM Comparison 0 Mode Update Register" name="PWM_CMPMUPD0" offset="0x13C" rw="W" size="4">
          <bitfield caption="Comparison x Enable Update" mask="0x00000001" name="CENUPD"/>
          <bitfield caption="Comparison x Trigger Update" mask="0x000000F0" name="CTRUPD"/>
          <bitfield caption="Comparison x Period Update" mask="0x00000F00" name="CPRUPD"/>
          <bitfield caption="Comparison x Update Period Update" mask="0x000F0000" name="CUPRUPD"/>
        </register>
        <register caption="PWM Comparison 1 Value Register" name="PWM_CMPV1" offset="0x140" rw="RW" size="4">
          <bitfield caption="Comparison x Value" mask="0x00FFFFFF" name="CV"/>
          <bitfield caption="Comparison x Value Mode" mask="0x01000000" name="CVM"/>
        </register>
        <register caption="PWM Comparison 1 Value Update Register" name="PWM_CMPVUPD1" offset="0x144" rw="W" size="4">
          <bitfield caption="Comparison x Value Update" mask="0x00FFFFFF" name="CVUPD"/>
          <bitfield caption="Comparison x Value Mode Update" mask="0x01000000" name="CVMUPD"/>
        </register>
        <register caption="PWM Comparison 1 Mode Register" name="PWM_CMPM1" offset="0x148" rw="RW" size="4">
          <bitfield caption="Comparison x Enable" mask="0x00000001" name="CEN"/>
          <bitfield caption="Comparison x Trigger" mask="0x000000F0" name="CTR"/>
          <bitfield caption="Comparison x Period" mask="0x00000F00" name="CPR"/>
          <bitfield caption="Comparison x Period Counter" mask="0x0000F000" name="CPRCNT"/>
          <bitfield caption="Comparison x Update Period" mask="0x000F0000" name="CUPR"/>
          <bitfield caption="Comparison x Update Period Counter" mask="0x00F00000" name="CUPRCNT"/>
        </register>
        <register caption="PWM Comparison 1 Mode Update Register" name="PWM_CMPMUPD1" offset="0x14C" rw="W" size="4">
          <bitfield caption="Comparison x Enable Update" mask="0x00000001" name="CENUPD"/>
          <bitfield caption="Comparison x Trigger Update" mask="0x000000F0" name="CTRUPD"/>
          <bitfield caption="Comparison x Period Update" mask="0x00000F00" name="CPRUPD"/>
          <bitfield caption="Comparison x Update Period Update" mask="0x000F0000" name="CUPRUPD"/>
        </register>
        <register caption="PWM Comparison 2 Value Register" name="PWM_CMPV2" offset="0x150" rw="RW" size="4">
          <bitfield caption="Comparison x Value" mask="0x00FFFFFF" name="CV"/>
          <bitfield caption="Comparison x Value Mode" mask="0x01000000" name="CVM"/>
        </register>
        <register caption="PWM Comparison 2 Value Update Register" name="PWM_CMPVUPD2" offset="0x154" rw="W" size="4">
          <bitfield caption="Comparison x Value Update" mask="0x00FFFFFF" name="CVUPD"/>
          <bitfield caption="Comparison x Value Mode Update" mask="0x01000000" name="CVMUPD"/>
        </register>
        <register caption="PWM Comparison 2 Mode Register" name="PWM_CMPM2" offset="0x158" rw="RW" size="4">
          <bitfield caption="Comparison x Enable" mask="0x00000001" name="CEN"/>
          <bitfield caption="Comparison x Trigger" mask="0x000000F0" name="CTR"/>
          <bitfield caption="Comparison x Period" mask="0x00000F00" name="CPR"/>
          <bitfield caption="Comparison x Period Counter" mask="0x0000F000" name="CPRCNT"/>
          <bitfield caption="Comparison x Update Period" mask="0x000F0000" name="CUPR"/>
          <bitfield caption="Comparison x Update Period Counter" mask="0x00F00000" name="CUPRCNT"/>
        </register>
        <register caption="PWM Comparison 2 Mode Update Register" name="PWM_CMPMUPD2" offset="0x15C" rw="W" size="4">
          <bitfield caption="Comparison x Enable Update" mask="0x00000001" name="CENUPD"/>
          <bitfield caption="Comparison x Trigger Update" mask="0x000000F0" name="CTRUPD"/>
          <bitfield caption="Comparison x Period Update" mask="0x00000F00" name="CPRUPD"/>
          <bitfield caption="Comparison x Update Period Update" mask="0x000F0000" name="CUPRUPD"/>
        </register>
        <register caption="PWM Comparison 3 Value Register" name="PWM_CMPV3" offset="0x160" rw="RW" size="4">
          <bitfield caption="Comparison x Value" mask="0x00FFFFFF" name="CV"/>
          <bitfield caption="Comparison x Value Mode" mask="0x01000000" name="CVM"/>
        </register>
        <register caption="PWM Comparison 3 Value Update Register" name="PWM_CMPVUPD3" offset="0x164" rw="W" size="4">
          <bitfield caption="Comparison x Value Update" mask="0x00FFFFFF" name="CVUPD"/>
          <bitfield caption="Comparison x Value Mode Update" mask="0x01000000" name="CVMUPD"/>
        </register>
        <register caption="PWM Comparison 3 Mode Register" name="PWM_CMPM3" offset="0x168" rw="RW" size="4">
          <bitfield caption="Comparison x Enable" mask="0x00000001" name="CEN"/>
          <bitfield caption="Comparison x Trigger" mask="0x000000F0" name="CTR"/>
          <bitfield caption="Comparison x Period" mask="0x00000F00" name="CPR"/>
          <bitfield caption="Comparison x Period Counter" mask="0x0000F000" name="CPRCNT"/>
          <bitfield caption="Comparison x Update Period" mask="0x000F0000" name="CUPR"/>
          <bitfield caption="Comparison x Update Period Counter" mask="0x00F00000" name="CUPRCNT"/>
        </register>
        <register caption="PWM Comparison 3 Mode Update Register" name="PWM_CMPMUPD3" offset="0x16C" rw="W" size="4">
          <bitfield caption="Comparison x Enable Update" mask="0x00000001" name="CENUPD"/>
          <bitfield caption="Comparison x Trigger Update" mask="0x000000F0" name="CTRUPD"/>
          <bitfield caption="Comparison x Period Update" mask="0x00000F00" name="CPRUPD"/>
          <bitfield caption="Comparison x Update Period Update" mask="0x000F0000" name="CUPRUPD"/>
        </register>
        <register caption="PWM Comparison 4 Value Register" name="PWM_CMPV4" offset="0x170" rw="RW" size="4">
          <bitfield caption="Comparison x Value" mask="0x00FFFFFF" name="CV"/>
          <bitfield caption="Comparison x Value Mode" mask="0x01000000" name="CVM"/>
        </register>
        <register caption="PWM Comparison 4 Value Update Register" name="PWM_CMPVUPD4" offset="0x174" rw="W" size="4">
          <bitfield caption="Comparison x Value Update" mask="0x00FFFFFF" name="CVUPD"/>
          <bitfield caption="Comparison x Value Mode Update" mask="0x01000000" name="CVMUPD"/>
        </register>
